Revit 2024 API
FabricationConfiguration.GetMaterialGUID Method
 Gets the material GUID by its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public Guid GetMaterialGUID(
	int materialId
)
Visual Basic
Public Function GetMaterialGUID ( _
	materialId As Integer _
) As Guid
Visual C++
public:
Guid GetMaterialGUID(
	int materialId
)
Parameters
materialId
Type: System.Int32
 The material identifier.
Return Value
 The material GUID. Returns empty GUID if not found.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace